In [1]:
import pandas as pd
import numpy as np

# Series

In [2]:
obj = pd.Series([4, 7, -5, 3])
print(obj)

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
sales = pd.Series([100, 200, 100, 400])
print(sales.values)
print(sales.index)

[100 200 100 400]
RangeIndex(start=0, stop=4, step=1)

In [4]:
sales = pd.Series([100, 200, 100, 400], index = ['Jan', 'Feb', 'Mar', 'Apr'])
print(sales)

Jan    100
Feb    200
Mar    100
Apr    400
dtype: int64

In [5]:
print(sales.index)
print(sales.values)
print(sales['Jan'])

Index(['Jan', 'Feb', 'Mar', 'Apr'], dtype='object')
[100 200 100 400]
100

In [6]:
sales = pd.Series([100, 200, 100, 400], index = ['Jan', 'Feb', 'Mar', 'Apr'], name = "4 month sales" )
print(sales)

Jan    100
Feb    200
Mar    100
Apr    400
Name: 4 month sales, dtype: int64

In [7]:
sw = pd.Series([30, 40, 20, 50, 45, 35, 40], 
                            index=['Mon', 'Tue', 'Wed', 'Thur', 'Fri', 'Sat', 'Sun'], 
                            name = "Sandwitches sale whole week")
print(sw)

Mon     30
Tue     40
Wed     20
Thur    50
Fri     45
Sat     35
Sun     40
Name: Sandwitches sale whole week, dtype: int64

In [8]:
print(sw[3])
print("--------------------")
print(sw[[3, 5]])
print("--------------------")
print(sw[3:5])
print("--------------------")
print(sw[['Wed','Thur']])

50
--------------------
Thur    50
Sat     35
Name: Sandwitches sale whole week, dtype: int64
--------------------
Thur    50
Fri     45
Name: Sandwitches sale whole week, dtype: int64
--------------------
Wed     20
Thur    50
Name: Sandwitches sale whole week, dtype: int64

In [9]:
print(sw[sw<20])

Series([], Name: Sandwitches sale whole week, dtype: int64)

In [10]:
print(sw[sw <= 40])

Mon    30
Tue    40
Wed    20
Sat    35
Sun    40
Name: Sandwitches sale whole week, dtype: int64

In [11]:
sw * 2

Mon      60
Tue      80
Wed      40
Thur    100
Fri      90
Sat      70
Sun      80
Name: Sandwitches sale whole week, dtype: int64

In [12]:
print(sw)

Mon     30
Tue     40
Wed     20
Thur    50
Fri     45
Sat     35
Sun     40
Name: Sandwitches sale whole week, dtype: int64

In [13]:
sw = sw * 2
print(sw)

Mon      60
Tue      80
Wed      40
Thur    100
Fri      90
Sat      70
Sun      80
Name: Sandwitches sale whole week, dtype: int64

In [14]:
sw = sw / 2
print(sw)

Mon     30.0
Tue     40.0
Wed     20.0
Thur    50.0
Fri     45.0
Sat     35.0
Sun     40.0
Name: Sandwitches sale whole week, dtype: float64

In [15]:
import numpy as np
ar = np.array([3,2,4,5,6])
ind = np.array(['a', 'b', 'c', 'd', 'e'])

obj2 = pd.Series(ar, index = ind)
print(obj2)

a    3
b    2
c    4
d    5
e    6
dtype: int32

In [16]:
sdata = {'Sindh': 3500, 'Punjab': 3000, 'KPK': 2500, 'Balochistan': 2000}
tax_by_state = pd.Series(sdata)
print(tax_by_state)

Sindh          3500
Punjab         3000
KPK            2500
Balochistan    2000
dtype: int64

In [17]:
sdata = {'Sindh': 3500, 'Punjab': 3000, 'KPK': 2500, 'Balochistan': 2000}
tax_by_state = pd.Series(sdata, index = ['Punjab', 'Sindh', 'KPK', 'Balochistan', 'GB'])
print(tax_by_state)

Punjab         3000.0
Sindh          3500.0
KPK            2500.0
Balochistan    2000.0
GB                NaN
dtype: float64

In [18]:
print(pd.isnull(tax_by_state))
print(tax_by_state.isnull())

Punjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
dtype: bool
Punjab         False
Sindh          False
KPK            False
Balochistan    False
GB              True
dtype: bool

**Soure of Data**
* Data from direct entry in Series method 
* Data from numpy array or list 
* Data from dictionary

# Data Frame

In [19]:
import pandas as pd

apples = pd.Series([3, 2, 0, 1])
oranges = pd.Series([3, 2, 0, 1])
print(apples, oranges)

data = {'apples': apples, 'oranges': oranges}
fruits_df = pd.DataFrame(data)
print(fruits_df)

0    3
1    2
2    0
3    1
dtype: int64 0    3
1    2
2    0
3    1
dtype: int64
   apples  oranges
0       3        3
1       2        2
2       0        0
3       1        1

In [20]:
state = ['Ohio', 'Ohio', 'Ohio', 'Neveda', 'Neveda', 'Neveda' ]
year = [2000, 2001, 2002, 2001, 2002, 2003]
pop = [1.5, 1.7, 3.4, 2.4, 2.9, 3.2]
data = { 'State': state,
       'Year': year,
       'Pop': pop}
df = pd.DataFrame(data)
print(df)

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.4
3  Neveda  2001  2.4
4  Neveda  2002  2.9
5  Neveda  2003  3.2

In [21]:
index = ['1st', '2nd', '3rd', '4th', '5th', '6th']
df = pd.DataFrame(data, index)
print(df)

      State  Year  Pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.4
4th  Neveda  2001  2.4
5th  Neveda  2002  2.9
6th  Neveda  2003  3.2

In [22]:
df.head()

      State  Year  Pop
1st    Ohio  2000  1.5
2nd    Ohio  2001  1.7
3rd    Ohio  2002  3.4
4th  Neveda  2001  2.4
5th  Neveda  2002  2.9

In [23]:
df = pd.DataFrame(data, columns = ['Year', 'State', 'Pop'])  #change columns arrangement
df.head()

   Year   State  Pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.4
3  2001  Neveda  2.4
4  2002  Neveda  2.9

In [24]:
df.columns

Index(['Year', 'State', 'Pop'], dtype='object')

In [25]:
df.index

RangeIndex(start=0, stop=6, step=1)

## A column in DataFrame can be retrieved as a Series either by dict-like notation or  by attribute

In [26]:
df['State'] #this is dict-like notation access

0      Ohio
1      Ohio
2      Ohio
3    Neveda
4    Neveda
5    Neveda
Name: State, dtype: object

In [27]:
#this is another method to access which is attribute style
df.State

0      Ohio
1      Ohio
2      Ohio
3    Neveda
4    Neveda
5    Neveda
Name: State, dtype: object

In [28]:
state = ['Ohio', 'Ohio', 'Ohio', 'Neveda', 'Neveda', 'Neveda' ]
year = [2000, 2001, 2002, 2001, 2002, 2003]
pop = [1.5, 1.7, 3.4, 2.4, 2.9, 3.2]
data = { 'State': state,
       'Year': year,
       'Pop': pop}
df = pd.DataFrame(data)
df.head()

    State  Year  Pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.4
3  Neveda  2001  2.4
4  Neveda  2002  2.9

In [29]:
frame2 = pd.DataFrame(data, columns =['year', 'state', 'pop', 'debt'],
                     index = ['one', 'two', 'three', 'four', 'five', 'six'])
ln = len(frame2)
rng = np.arange(ln)
print(rng)
frame2['debt'] = rng
frame2.head()

[0 1 2 3 4 5]

      year state  pop  debt
one    NaN   NaN  NaN     0
two    NaN   NaN  NaN     1
three  NaN   NaN  NaN     2
four   NaN   NaN  NaN     3
five   NaN   NaN  NaN     4

## Point to remember, inserting new values, needs to be match in length of DataFrame ( mean number of elements)

## Function Application and Mapping

In [30]:
frame = pd.DataFrame(np.random.randn(4,3),
                    columns = list('bde'),
                    index = ['Uthao', 'Ohio', 'Texas', 'Oregon'])
#print(frame)
print(np.abs(frame))

#using simple method
print(frame['d'].min())
print(frame['d'].max())
print(frame['d'].min() - frame['d'].min())


#using lamda function 
f = lambda x: x.max() - x.min()
df = frame.apply(f)
print(df, type(df))


#using simple functions
def min_max(x):
    minimum = x.min()
    maximum = x.max()
    return pd.Series([maximum, minimum], index =[max, min])

df = frame.apply(min_max)
print(df, type(df))

               b         d         e
Uthao   0.097083  2.073900  0.600822
Ohio    1.061361  0.457979  0.108830
Texas   1.862001  1.794499  2.451859
Oregon  0.007053  2.096861  0.062666
-2.096861414503813
0.4579791303074362
0.0
b    1.959084
d    2.554841
e    2.560689
dtype: float64 <class 'pandas.core.series.Series'>
                                b         d         e
<built-in function max>  1.862001  0.457979  2.451859
<built-in function min> -0.097083 -2.096861 -0.108830 <class 'pandas.core.frame.DataFrame'>

In [31]:
import numpy as np
import pandas as pd

data_df = pd.DataFrame(np.arange(16).reshape((4, 4)),
                      index=['Ohio', 'Colorado', 'Utah', 'New York'],
                      columns=['one', 'two', 'three', 'four'])

print(data_df, '\n')
data_df = data_df.drop('two', axis=1) #deleting columns
print(data_df)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [32]:
data_df = data_df.drop('Colorado', axis=0) #deleting rows
print(data_df)

          one  three  four
Ohio        0      2     3
Utah        8     10    11
New York   12     14    15

# Indexing,  Selection and Filtering

In [33]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0,3,6])
print(obj3)
#might create a new rows
#obj3 = obj3.reindex(range(9))
#print(obj3, '\n')
obj3 = obj3.reindex(range(9), method='ffill')
print(obj3)

0      blue
3    purple
6    yellow
dtype: object
0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

# Data Loading, Storage and File Formatting

In [34]:
import pandas as pd

sample_df = pd.read_csv("examples/sample.csv")
print(sample_df)

  studentid         name   chimestry   physics   english   math
0       A01     arif ali          20        30        40     50
1       A02  kamran khan          30        40        50     60
2       A03   imran ali           40        50        60     70
3       A04  kashif khan          50        60        70     80

In [35]:
sample_df = pd.read_csv("examples/sample.csv", 
                       names = ['id', 'name', 'chem', 'phy', 'eng', 'mth']) # we can change the column names while loading
print(sample_df)

          id         name        chem       phy       eng    mth
0  studentid         name   chimestry   physics   english   math
1        A01     arif ali          20        30        40     50
2        A02  kamran khan          30        40        50     60
3        A03   imran ali           40        50        60     70
4        A04  kashif khan          50        60        70     80

In [36]:
#skip rows
sample_df = pd.read_csv("examples/sample.csv", skiprows = 1,
                       names = ['id', 'name', 'chem', 'phy', 'eng', 'mth']) # we can change the column names while loading
print(sample_df)

    id         name  chem  phy  eng  mth
0  A01     arif ali    20   30   40   50
1  A02  kamran khan    30   40   50   60
2  A03   imran ali     40   50   60   70
3  A04  kashif khan    50   60   70   80

In [39]:
s2_df = pd.read_csv("examples/sample2.csv")
print(s2_df)

parsed = pd.read_csv("examples/sample2.csv", index_col = ['key1', 'key2'])
parsed

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

## Handling missing values

In [40]:
result = pd.read_csv("examples/sample3.csv")
print(result)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [42]:
#changing data while loading 
#dictionary = {coulumn_name : [source_value, target_value]}
sentinals = {'message' : ['foo', 'NA']}
pd.read_csv("examples/sample3.csv", na_values=sentinals)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [44]:
result = pd.read_csv("examples/sample3.csv", na_values=["NULL"])

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

## Reading and Text files in pieces

In [46]:
pd.read_csv("datasets/train.csv")

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
0,842,0,2.2,0,1,0,7,0.6,188,2,...,20,756,2549,9,7,19,0,0,1,1
1,1021,1,0.5,1,0,1,53,0.7,136,3,...,905,1988,2631,17,3,7,1,1,0,2
2,563,1,0.5,1,2,1,41,0.9,145,5,...,1263,1716,2603,11,2,9,1,1,0,2
3,615,1,2.5,0,0,0,10,0.8,131,6,...,1216,1786,2769,16,8,11,1,0,0,2
4,1821,1,1.2,0,13,1,44,0.6,141,2,...,1208,1212,1411,8,2,15,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,794,1,0.5,1,0,1,2,0.8,106,6,...,1222,1890,668,13,4,19,1,1,0,0
1996,1965,1,2.6,1,0,0,39,0.2,187,4,...,915,1965,2032,11,10,16,1,1,1,2
1997,1911,0,0.9,1,1,1,36,0.7,108,8,...,868,1632,3057,9,1,5,1,1,0,3
1998,1512,0,0.9,0,4,1,46,0.1,145,5,...,336,670,869,18,10,19,1,1,1,0
1999,510,1,2.0,1,5,1,45,0.9,168,6,...,483,754,3919,19,4,2,1,1,1,3

In [47]:
#extracting selected rows from a large datasets
pd.read_csv("datasets/train.csv", nrows=200)

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
0,842,0,2.2,0,1,0,7,0.6,188,2,...,20,756,2549,9,7,19,0,0,1,1
1,1021,1,0.5,1,0,1,53,0.7,136,3,...,905,1988,2631,17,3,7,1,1,0,2
2,563,1,0.5,1,2,1,41,0.9,145,5,...,1263,1716,2603,11,2,9,1,1,0,2
3,615,1,2.5,0,0,0,10,0.8,131,6,...,1216,1786,2769,16,8,11,1,0,0,2
4,1821,1,1.2,0,13,1,44,0.6,141,2,...,1208,1212,1411,8,2,15,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,1526,0,2.1,0,1,1,23,0.2,117,7,...,718,751,2227,18,10,3,1,1,0,2
196,1989,0,2.5,1,0,1,41,0.8,94,3,...,1100,1497,1665,17,9,12,1,1,1,2
197,1308,0,1.9,0,0,1,61,0.7,106,3,...,59,1215,3355,15,2,4,1,0,1,3
198,609,0,0.5,0,3,0,26,0.3,93,4,...,938,1948,1866,11,10,14,1,1,1,1
199,1905,0,0.6,1,9,1,36,0.4,119,3,...,825,1542,1287,13,4,16,1,0,0,1

In [62]:
#to read a file in pieces, specify a chunksize as a number of rows:
chunks = pd.read_csv("datasets/train.csv", chunksize=200)
chunkList = []
for chunk in chunks:
    #print(chunk.head())
    chunkList.append(chunk)
    
df = chunkList[0]
df.head()

,battery_power,blue,clock_speed,dual_sim,fc,four_g,int_memory,m_dep,mobile_wt,n_cores,...,px_height,px_width,ram,sc_h,sc_w,talk_time,three_g,touch_screen,wifi,price_range
1800,1358,0,1.7,0,0,0,60,0.6,147,3,...,889,1635,440,14,10,13,1,0,0,0
1801,1035,1,1.9,1,8,0,11,1.0,173,6,...,831,1709,2002,17,8,5,1,1,0,1
1802,1289,0,0.8,1,3,1,16,0.9,161,6,...,713,1854,3167,14,8,20,1,1,0,3
1803,1445,0,2.2,1,2,0,37,0.4,82,2,...,527,1393,3480,17,16,17,1,1,1,3
1804,1702,1,2.3,1,12,1,47,0.6,107,2,...,1284,1643,595,10,0,19,1,0,1,1

## Reading from Multipsace Text File